Question 1
What's the version of NumPy that you installed?

In [1]:
import numpy as np
np.__version__

'1.23.3'

Question 2
How many records are in the dataset?

Here you need to specify the number of rows.

16
6572
11914
18990

In [3]:
import pandas as pd
df = pd.read_csv("data.csv")
print(df.shape[0])

11914

Question 3
Who are the most frequent car manufacturers (top-3) according to the dataset?

Chevrolet, Volkswagen, Toyota
Chevrolet, Ford, Toyota
Ford, Volkswagen, Toyota
Chevrolet, Ford, Volkswagen
Note: You should rely on "Make" column in this question.

In [4]:
df.head(1)

,Make,Model,Year,Engine Fuel Type,Engine HP,Engine Cylinders,Transmission Type,Driven_Wheels,Number of Doors,Market Category,Vehicle Size,Vehicle Style,highway MPG,city mpg,Popularity,MSRP
0,BMW,1 Series M,2011,premium unleaded (required),335.0,6.0,MANUAL,rear wheel drive,2.0,"Factory Tuner,Luxury,High-Performance",Compact,Coupe,26,19,3916,46135

In [18]:
print(df.groupby(by =["Make"]).count().sort_values(["Model"],ascending=False).head(3))

            Model  Year  Engine Fuel Type  Engine HP  Engine Cylinders  \
Make
Chevrolet    1123  1123              1123       1117              1121
Ford          881   881               881        868               881
Volkswagen    809   809               809        809               805

            Transmission Type  Driven_Wheels  Number of Doors  \
Make
Chevrolet                1123           1123             1123
Ford                      881            881              881
Volkswagen                809            809              809

            Market Category  Vehicle Size  Vehicle Style  highway MPG  \
Make
Chevrolet               622          1123           1123         1123
Ford                    499           881            881          881
Volkswagen              585           809            809          809

            city mpg  Popularity  MSRP
Make
Chevrolet       1123        1123  1123
Ford             881         881   881
Volkswagen       809         809   809

Question 4
What's the number of unique Audi car models in the dataset?

3
16
26
34

In [32]:
df.loc[df['Make']=='Audi','Model'].unique()

array(['100', '200', '80', '90', 'A3', 'A4 allroad', 'A4', 'A5', 'A6',
       'A7', 'A8', 'allroad quattro', 'allroad', 'Cabriolet', 'Coupe',
       'Q3', 'Q5', 'Q7', 'R8', 'RS 4', 'RS 5', 'RS 6', 'RS 7', 'S3', 'S4',
       'S5', 'S6', 'S7', 'S8', 'SQ5', 'TT RS', 'TT', 'TTS', 'V8'],
      dtype=object)

Question 5
How many columns in the dataset have missing values?

5
6
7
8

In [42]:
df.isnull().sum()

Make                    0
Model                   0
Year                    0
Engine Fuel Type        3
Engine HP              69
Engine Cylinders       30
Transmission Type       0
Driven_Wheels           0
Number of Doors         6
Market Category      3742
Vehicle Size            0
Vehicle Style           0
highway MPG             0
city mpg                0
Popularity              0
MSRP                    0
dtype: int64

Question 6
Find the median value of "Engine Cylinders" column in the dataset.
Next, calculate the most frequent value of the same "Engine Cylinders".
Use the fillna method to fill the missing values in "Engine Cylinders" with the most frequent value from the previous step.
Now, calculate the median value of "Engine Cylinders" once again.
Has it changed?

Hint: refer to existing mode and median functions to complete the task.

Yes
No

In [43]:
df["Engine Cylinders"].median()

6.0

In [44]:
df["Engine Cylinders"].mode()

0    4.0
Name: Engine Cylinders, dtype: float64

In [45]:
df["Engine Cylinders"].fillna(df["Engine Cylinders"].mode())

0        6.0
1        6.0
2        6.0
3        6.0
4        6.0
        ...
11909    6.0
11910    6.0
11911    6.0
11912    6.0
11913    6.0
Name: Engine Cylinders, Length: 11914, dtype: float64

In [46]:
df["Engine Cylinders"].median()

6.0

Question 7
Select all the "Lotus" cars from the dataset.
Select only columns "Engine HP", "Engine Cylinders".
Now drop all duplicated rows using drop_duplicates method (you should get a dataframe with 9 rows).
Get the underlying NumPy array. Let's call it X.
Compute matrix-matrix multiplication between the transpose of X and X. To get the transpose, use X.T. Let's call the result XTX.
Invert XTX.
Create an array y with values [1100, 800, 750, 850, 1300, 1000, 1000, 1300, 800].
Multiply the inverse of XTX with the transpose of X, and then multiply the result by y. Call the result w.
What's the value of the first element of w?
Note: You just implemented linear regression. We'll talk about it in the next lesson.

-0.0723
4.5949
31.6537
63.5643

In [54]:
df.loc[df["Make"]=="Lotus"].head(2)

,Make,Model,Year,Engine Fuel Type,Engine HP,Engine Cylinders,Transmission Type,Driven_Wheels,Number of Doors,Market Category,Vehicle Size,Vehicle Style,highway MPG,city mpg,Popularity,MSRP
3912,Lotus,Elise,2009,premium unleaded (required),189.0,4.0,MANUAL,rear wheel drive,2.0,"Exotic,High-Performance",Compact,Convertible,27,21,613,43995
3913,Lotus,Elise,2009,premium unleaded (required),218.0,4.0,MANUAL,rear wheel drive,2.0,"Exotic,High-Performance",Compact,Convertible,26,20,613,54990

In [55]:
df.loc[df["Make"]=="Lotus",["Engine HP",	"Engine Cylinders"]].head(2)

      Engine HP  Engine Cylinders
3912      189.0               4.0
3913      218.0               4.0

In [57]:
x = df.loc[df["Make"]=="Lotus",["Engine HP",	"Engine Cylinders"]].drop_duplicates()

In [65]:
x

      Engine HP  Engine Cylinders
3912      189.0               4.0
3913      218.0               4.0
3918      217.0               4.0
4216      350.0               8.0
4257      400.0               6.0
4259      276.0               6.0
4262      345.0               6.0
4292      257.0               4.0
4293      240.0               4.0

In [58]:
XTX =x.T

In [66]:
XTX

,3912,3913,3918,4216,4257,4259,4262,4292,4293
Engine HP,189.0,218.0,217.0,350.0,400.0,276.0,345.0,257.0,240.0
Engine Cylinders,4.0,4.0,4.0,8.0,6.0,6.0,6.0,4.0,4.0

In [59]:
y = [1100, 800, 750, 850, 1300, 1000, 1000, 1300, 800]

In [60]:
w=(np.power(XTX, -1)*XTX)*y

In [64]:
w

,3912,3913,3918,4216,4257,4259,4262,4292,4293
Engine HP,1100.0,800.0,750.0,850.0,1300.0,1000.0,1000.0,1300.0,800.0
Engine Cylinders,1100.0,800.0,750.0,850.0,1300.0,1000.0,1000.0,1300.0,800.0